---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarContainerIterator
source: html/a1aff36e-7cd3-d0b8-f192-c47f4dfb8e7d.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerIterator

An iterator to a Rebar Container.

## Syntax (C#)
```csharp
public class RebarContainerIterator : IEnumerator<RebarContainerItem>
```